docs/pages/docs/development-docs/rfcs/rfc001-sum-types/rfc001-sum-types.org
#+TITLE: RFC 001: Extend Quint with Row-Polymorphic Sum Types
#+AUTHOR: Shon Feder
#+DATE: <2023-08-03 Thu>
#+OPTIONS: toc:nil
#+LATEX_COMPILER: xelatex

* Overview
This section gives a concise overview of the principle proposal. In
depth discussion follows in [[Discussion][Discussion]].

** Concrete syntax
The concrete syntax falls into three categories, corresponding three aspects of
the semantics:

- Declaring that a type is allowed in a context.
- Constructing an element of the declared type.
- Eliminating an element of the declared type (to derive an element of some
  other type).

Here we merely state the proposed syntax. See [[Concrete Syntax][the discussion of concrete syntax]]
for consideration of motivations and trade offs.

*** Declaration
The proposed syntax fits complements our syntax for records and follows the
precedent of most languages that include support for general sum-types:

#+begin_src quint
type T =
  | A(int)
  | B(str)
  | C
#+end_src

As indicated by =C=, labels with no associated expression type are allowed.
These are sugar for a label associated with the unit type (i.e., the empty
record). The above is therefore a representation of

#+begin_src quint
type T =
  | A(int)
  | B(str)
  | C({})
#+end_src

*** Constructors

Internally, we need to add an operator =variant= similar to the "injection"
operator from [[https://www.microsoft.com/en-us/research/publication/extensible-records-with-scoped-labels/][Leijen05]]:

#+begin_src haskell
<l = _> :: ∀αr . α → <l :: α | r > -- injection
#+end_src


This operation injects an expression of type =α= into a sum-type that includes a
variant associating label =l= with type =α=.  However, if we don't want to
expose the row-polymorphism to users, we'll need a more restrictive typing. This
is discussed in the section on typing rules.

We provide syntax sugar for users: when a sum type declaration is parsed,
constructor operations for each variant will be generated internally. E.g., for
the type =T= defined above, we will add to the context the following operators:

#+begin_src quint
pure def A(x:int): T = variant(A, x)
pure def B(x:str): T = variant(B, x)
pure def C(): T      = variant(C, {})
#+end_src

*** Case analyses
Expressions of a sum type can be eliminated using a case analysis via
a =match= statement. Following Rust's syntax, we write that as

#+begin_src quint
match e {
  | A(a) => ...
  | B(b) => ...
  | C    => ...
}
#+end_src

This construct can either be a primitive or syntax sugar for a more
primitive =decompose= operator, discussed below.

We could also consider a case analysis ={ A(a) => e1, B(b) => e2, C => e3 }= --
where =e1, e2, e3 : S= -- as syntax sugar for an anonymous operator of type =T
=> S=. =match= would then be syntax sugar for operator application. This follows
Scala's case blocks or OCaml's =function= keyword and would allow idioms such
as:

#+begin_src quint
setOfTs.map({ A(a) => e1 | B(b) => e2 | C => e3 })
#+end_src

instead of requiring

#+begin_src quint
setOfTs.map(x => match x { A(a) => e1| B(b) => e2| C => e3 })
#+end_src

** Statics
These type rules assume we keep our current approach of using quint
strings for labels. But see my argument for simplifying our approach
under [[*Drop the exotic operators][Drop the exotic operators]]. See the
discussion in [[*Statics][Statics]] below for a detailed explanation and
analysis.

*** Construction
The typing rule for constructing a variant of a sum type:

#+CAPTION: SUM-INTRO
$$
\frac
{
\Gamma \vdash e \colon (t, c) \quad
\Gamma \vdash `l' \colon str \quad
definedType(s) \quad
free(v)
}
{
\Gamma \vdash \ variant(`l', e) \ :
(s, c \land s \sim \langle \ l \colon t | v \ \rangle)
}
$$


This rule is substantially different from [[https://www.microsoft.com/en-us/research/publication/extensible-records-with-scoped-labels/][Leijen05]]'s

#+begin_src haskell
<l = i> :: ∀αr . α → <l :: α | r > -- injection
#+end_src


because we have decided not to expose the underlying row-polymorphism for sum
types at this point. This introduces the non-trivial complication of needing to
introduce the typing context onto our judgments (this is what we gesture at with
the side condition =definedType(s)=).

*** Elimination

The typing rule for eliminating a variant of a sum type via case
analysis:

#+CAPTION: SUM-ELIM
$$
\frac{
\Gamma \vdash e : (s, c) \quad
\Gamma, x_1 \vdash e_1 : (t, c_1) \quad \ldots \quad \Gamma, x_n \vdash e_n : (t, c_n) \quad
\Gamma, \langle v \rangle \vdash e_{n+1} : (t, c_{n+1}) \quad
fresh(v)
}{
\Gamma \vdash \ match \ e \ \{ i_1 : x_1 \Rightarrow e_1, \ldots, i_n : x_n \Rightarrow e_n \} : (t,
c \land c_1 \land \ldots \land c_n \land c_{n+1} \land
s \sim \langle i_1 : t_1, \ldots, i_n : t_n | v \rangle)
}
$$


This gives a rule in our system that is sufficient to capture [[https://www.microsoft.com/en-us/research/publication/extensible-records-with-scoped-labels/][Leijen05]]'s

#+begin_src haskell
(l ∈ _ ? _ : _) :: ∀αβr . <l :: α | r> → (α → β) → (<r> → β) → β -- decomposition
#+end_src

since we can define decomposition for any label =L= via

#+begin_src quint
def decomposeL(e: (L(a) | r), f: a => b, default : r => b) = 
  match e { 
    | L(x) => f(x) 
    | r    => default(r) 
  }
#+end_src

However we can define =match= as syntax sugar for the decompose
primitive if we prefer.

** Dynamics
The dynamics in the simulator should be straightforward and is not
discussed here. Translation to Apalache for symbolic execution in the
model checker is also expected to be relatively straight forward, since
Apalache has a very similar form of row-based sum typing.

The general rules for eager evaluation can be found in
[[https://www.cs.cmu.edu/~rwh/pfpl.html][PFPL]], section 11.2.
Additional design work for this will be prepared if needed.

--------------

This concludes the tl;dr overview of the proposal. The remaining is an
indepth (still v. rough in places, discussion).

* Discussion
