docs/pages/docs/development-docs/rfcs/rfc001-sum-types/rfc001-sum-types.tex
% Created 2023-08-05 Sat 00:09
% Intended LaTeX compiler: xelatex
\documentclass[11pt]{article}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Shon Feder}
\date{\textit{<2023-08-03 Thu>}}
\title{RFC 001: Extend Quint with Row-Polymorphic Sum Types}
\hypersetup{
 pdfauthor={Shon Feder},
 pdftitle={RFC 001: Extend Quint with Row-Polymorphic Sum Types},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.1 (Org mode 9.6.1)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Overview}
\label{sec:orgabf3583}
This section gives a concise overview of the principle proposal. In
depth discussion follows in \hyperref[sec:org050246d]{Discuisson}.

\subsection{Concrete syntax}
\label{sec:orga6e64d7}
The concrete syntax falls into three categories, corresponding three aspects of
the semantics:

\begin{itemize}
\item Declaring that a type is allowed in a context.
\item Constructing an element of the declared type.
\item Eliminating an element of the declared type (to derive an element of some
other type).
\end{itemize}

Here we merely state the proposed syntax. See \hyperref[sec:orgb377490]{the discussion of concrete syntax}
for consideration of motivations and trade offs.

\subsubsection{Declaration}
\label{sec:orgf216e02}
The proposed syntax fits complements our syntax for records and follows the
precedent of most languages that include support for general sum-types:

\begin{verbatim}
type T =
  | A(int)
  | B(str)
  | C
\end{verbatim}

As indicated by \texttt{C}, labels with no associated expression type are allowed.
These are sugar for a label associated with the unit type (i.e., the empty
record). The above is therefore a representation of

\begin{verbatim}
type T =
  | A(int)
  | B(str)
  | C({})
\end{verbatim}

\subsubsection{Constructors}
\label{sec:orgc7e9737}

Internally, we need to add an operator \texttt{variant} similar to the ``injection''
operator from \href{https://www.microsoft.com/en-us/research/publication/extensible-records-with-scoped-labels/}{Leijen05}:

\begin{verbatim}
<l = _> :: ∀αr . α → <l :: α | r > -- injection
\end{verbatim}


This operation injects an expression of type \texttt{α} into a sum-type that includes a
variant associating label \texttt{l} with type \texttt{α}.  However, if we don't want to
expose the row-polymorphism to users, we'll need a more restrictive typing. This
is discussed in the section on typing rules.

We provide syntax sugar for users: when a sum type declaration is parsed,
constructor operations for each variant will be generated internally. E.g., for
the type \texttt{T} defined above, we will add to the context the following operators:

\begin{verbatim}
pure def A(x:int): T = variant(A, x)
pure def B(x:str): T = variant(B, x)
pure def C(): T      = variant(C, {})
\end{verbatim}

\subsubsection{Case analyses}
\label{sec:orgc4b162c}
Expressions of a sum type can be eliminated using a case analysis via
a \texttt{match} statement. Following Rust's syntax, we write that as

\begin{verbatim}
match e {
  | A(a) => ...
  | B(b) => ...
  | C    => ...
}
\end{verbatim}

This construct can either be a primitive or syntax sugar for a more
primitive \texttt{decompose} operator, discussed below.

We could also consider a case analysis \texttt{\{ A(a) => e1, B(b) => e2, C => e3 \}} --
where \texttt{e1, e2, e3 : S} -- as syntax sugar for an anonymous operator of type \texttt{T
=> S}. \texttt{match} would then be syntax sugar for operator application. This follows
Scala's case blocks or OCaml's \texttt{function} keyword and would allow idioms such
as:

\begin{verbatim}
setOfTs.map({ A(a) => e1 | B(b) => e2 | C => e3 })
\end{verbatim}

instead of requiring

\begin{verbatim}
setOfTs.map(x => match x { A(a) => e1| B(b) => e2| C => e3 })
\end{verbatim}

\subsection{Statics}
\label{sec:org04cad71}
These type rules assume we keep our current approach of using quint
strings for labels. But see my argument for simplifying our approach
under \hyperref[sec:orgd5aba72]{Drop the exotic operators}. See the
discussion in \hyperref[sec:org6da5dcb]{Statics} below for a detailed explanation and
analysis.

\subsubsection{Construction}
\label{sec:org23575b1}
The typing rule for constructing a variant of a sum type:

$$
\frac
{
\Gamma \vdash e \colon (t, c) \quad
\Gamma \vdash `l' \colon str \quad
definedType(s) \quad
free(v)
}
{
\Gamma \vdash \ variant(`l', e) \ :
(s, c \land s \sim \langle \ l \colon t | v \ \rangle)
}
$$


This rule is substantially different from \href{https://www.microsoft.com/en-us/research/publication/extensible-records-with-scoped-labels/}{Leijen05}'s

\begin{verbatim}
<l = i> :: ∀αr . α → <l :: α | r > -- injection
\end{verbatim}


because we have decided not to expose the underlying row-polymorphism for sum
types at this point. This introduces the non-trivial complication of needing to
introduce the typing context onto our judgments (this is what we gesture at with
the side condition \texttt{definedType(s)}).

\subsubsection{Elimination}
\label{sec:orgf258cbd}

The typing rule for eliminating a variant of a sum type via case
analysis:

$$
\frac{
\Gamma \vdash e : (s, c) \quad
\Gamma, x_1 \vdash e_1 : (t, c_1) \quad \ldots \quad \Gamma, x_n \vdash e_n : (t, c_n) \quad
\Gamma, \langle v \rangle \vdash e_{n+1} : (t, c_{n+1}) \quad
fresh(v)
}{
\Gamma \vdash \ match \ e \ \{ i_1 : x_1 \Rightarrow e_1, \ldots, i_n : x_n \Rightarrow e_n \} : (t,
c \land c_1 \land \ldots \land c_n \land c_{n+1} \land
s \sim \langle i_1 : t_1, \ldots, i_n : t_n | v \rangle)
}
$$


This gives a rule in our system that is sufficient to capture \href{https://www.microsoft.com/en-us/research/publication/extensible-records-with-scoped-labels/}{Leijen05}'s

\begin{verbatim}
(l ∈ _ ? _ : _) :: ∀αβr . <l :: α | r> → (α → β) → (<r> → β) → β -- decomposition
\end{verbatim}

since we can define decomposition for any label \texttt{L} via

\begin{verbatim}
def decomposeL(e: (L(a) | r), f: a => b, default : r => b) = 
  match e { 
    | L(x) => f(x) 
    | r    => default(r) 
  }
\end{verbatim}

However we can define \texttt{match} as syntax sugar for the decompose
primitive if we prefer.

\subsection{Dynamics}
\label{sec:orgd77d8b6}
The dynamics in the simulator should be straightforward and is not
discussed here. Translation to Apalache for symbolic execution in the
model checker is also expected to be relatively straight forward, since
Apalache has a very similar form of row-based sum typing.

The general rules for eager evaluation can be found in
\href{https://www.cs.cmu.edu/\~rwh/pfpl.html}{PFPL}, section 11.2.
Additional design work for this will be prepared if needed.

\noindent\rule{\textwidth}{0.5pt}

This concludes the tl;dr overview of the proposal. The remaining is an
indepth (still v. rough in places, discussion).
