docs/pages/docs/development-docs/rfcs/rfc001-sum-types/rfc001-sum-types.tex

\section{Discussion}
\label{sec:org050246d}
\subsection{Motivation}
\label{sec:org2103e46}
Quint's type system currently supports product types. Product types
(i.e., records, with tuples as a special case where fields are indexed
by an ordinal) let us specify \emph{conjunctions} of data types in a way that
is verifiable statically. This lets us describe more complex data
structures in terms of values of specific types that \textbf{must} be packaged
together. E.g., we might define a rectangle by its length and width and
a triangle by the lengths of its three sides. Using Quint's existing
syntax for product types, we'd specify this as follows:

\begin{verbatim}
type Rectangle = 
  { l : int
  , w : int }
type Triangle = 
  { a : int
  , b : int
  , c : int }
\end{verbatim}

Quint's type system does not yet have the dual construct,
\href{https://en.wikipedia.org/wiki/Tagged\_union}{sum types} (aka
``variants'', ``co-products'', or ``tagged unions''). Sum types specify
\emph{disjunctions} of data types in a way that is verifiable statically.
This lets us describe mutually exclusive alternatives between distinct
data structures that \textbf{may} occur together and be treated uniformly in
some context. E.g., we might wish to specify a datatype for shapes, so
we can work with collections that include both rectangles and triangles.
Using one of the proposed syntax option that will be motivated in the
following, this could be specified as

\begin{verbatim}
type Shape =
  | Rect(rectangle)
  | Tri(triangle)
\end{verbatim}

Having both product types and sum types (co-product types) gives us a
simple and powerful idiom for specifying families of data structures:

\begin{itemize}
\item We describe \emph{what must be given together} to form a product of the
specified type, and so \emph{what we may always make use of} by projection
when we are given such a product.
\item We describe \emph{which alternatives may be supplied} to form a co-product
of a specified type, and so \emph{what we must be prepared to handle}
during case analysis when we are given such a co-product.
\end{itemize}

E.g., a \texttt{rectangle} is defined by \emph{both} a length \emph{and} a width,
packaged together, while a \texttt{shape} is defined \emph{either} by a rectangle
\emph{or} a triangle. With these definitions established, we can then go on
to form and reason about collections of shapes like \texttt{Set[shape]}, or
define properties common to all shapes like
\texttt{isEquilateral : shape => bool}\footnote{The expressive power of these simple constructs comes from the
nice algebraic properties revealed when values of a type are
treated as equal up-to ismorphism. See, e.g.,
\url{https://codewords.recurse.com/issues/three/algebra-and-calculus-of-algebraic-data-types}}.

\subsection{Context}
\label{sec:orgea625f3}
\subsubsection{Existing plans and previous work}
\label{sec:orgc77cf04}
We have always planned to support co-products in quint: their utility is well
known and widely appreciated by engineers with experience in modern programming
languages. We introduced co-products to Apalache in
\url{https://github.com/apalache-mc/apalache/milestone/60} for the same reasons.
The design and implementation of the latter was worked out by ?? (????)
based on the paper \href{https://www.microsoft.com/en-us/research/publication/extensible-records-with-scoped-labels/}{``Extensible Records with Scoped Labels''}. At the core of this
design is a simple use of row-polymorphism that enables both extensible variants
and extensible records, giving us products and co-products in a one neat
package. The quint type system was also developed using row-polymorphism
following this design. As a result of this forethought, extension of quint's
type system and addition of syntax to support sum-types is expected to be
relatively straightforward.

\subsubsection{The gist of extensible row-typed records and sum types}
\label{sec:org6428ac3}
The core concept in the row-based approach we've opted for is the
following: we can use the same construct, called a ``row'', to represent
the \emph{conjoined} labeled fields of a product type and the \emph{alternative}
labeled choices of a sum type. That the row types are polymorphic lets
us extend the products and sums using row variables.

E.g., given the row

$$
i_1 : t_1 \ , \ldots \ , i_n : i_n | v
$$

with each \(t_k\)-typed field indexed by label \(i_k\) for
\(1 \le k \le n\) and the free row variable \(v\), then

$$
\{i_1 : t_1 \ , \ldots \ , i_n : i_n | v\}
$$

is an open record conjoining the fields, and

$$
\langle i_1 : t_1 \ , \ldots \ , i_n : i_n | v \rangle
$$

is an open sum type presenting the fields as (mutually exclusive)
alternatives. Both types are extensible by substituting \(v\) with
another (possibly open row). To represent a closed row, we omit the
trailing \(| v\).

\subsubsection{Quint's current type system}
\label{sec:org12dc16c}

The \href{https://github.com/informalsystems/quint/tree/main/doc/adr005-type-system.md}{current type system supported by quint} is based on a simplified version of
the constraint-based system presented in \href{https://www.microsoft.com/en-us/research/publication/complete-and-decidable-type-inference-for-gadts/}{``Complete and Decidable Type Inference
for GADTs''} augmented with extensible (currently, just) records based on
``Extensible Records with Scoped Labels''. A wrinkle in this genealogy is that
quint's type system includes neither GADTs nor scoped labels (and even the
extensiblity supported for records is limited). Moreover, due to their
respective foci, neither of the referenced papers includes a formalization the
complete statics for product types or sum types, and while we have implemented
support for product types in quint, we don't have our typing rules recorded.

\subsection{Statics}
\label{sec:org6da5dcb}
This section discusses the typing judgements that will allow us to
statically verify correct introduction and elimination of expressions
that are variants of a sum type. The following considerations have
informed the structure in which the proposed statics are discussed:

\begin{itemize}
\item Since sum-types are dual to product types, I consider their
complementary typing rules together: first I will present the relevant
rule for product types, then propose the complementary rule for sum
types. This should help maintain consistency between the two kinds of
typing judgements and ensure our implementations of both harmonize.
\item Since we don't have our existing product formation or elimination
rules described separate from the implementation, transcribing them
here can serve to juice our intuition, supplement our design
documentation, and perhaps give opportunity for refinement.
\item Since our homegrown type system has some idiosyncrasies that can
obscure the essence of the constructs under discussion, I precede the
exposition of each rule with a text-book example adapted from
\href{https://www.cs.cmu.edu/\~rwh/pfpl.html}{Practical Foundations for
Programming Languages}. This is only meant as a clarifying
touchstone.
\end{itemize}

\subsubsection{Eliminating products and introducing sums}
\label{sec:org5178260}
The elimination of products via projection and the introduction of sums
via injection are the simplest of the two pairs of rules.

\begin{enumerate}
\item Projection
\label{sec:org6c8b9ea}
