docs/pages/docs/development-docs/rfcs/rfc001-sum-types/rfc001-sum-types.org
**** Projection
Here is a concrete example of projecting a value out of a record using
our current syntax:

#+begin_src quint
val r : {a:int} = {a:1}
val ex : int = r.a
// Or, using our exotic field operator, which is currently the normal form
val ex_ : int = r.field("a")
#+end_src

A textbook rule for eliminating an expression with a finite product
types can be given as

$$
\frac
{ \Gamma \vdash e \colon \{ i_1 \hookrightarrow \tau_1, \ \ldots, \ i_n \hookrightarrow \tau_n \} \quad (1 \le k \le n)}
{ \Gamma \vdash e.i_k \colon \tau_k }
$$

Where \(i\) is drawn from a finite set of indexes used to label the
components of the product (e.g., fields of a record or positions in a
tuple) and \(i_j \hookrightarrow \tau_j\) maps the index \(i_j\) to the
corresponding type \(\tau_j\).

This rule tells us that, when an expression \(e\) with a product type is
derivable from a context, we can eliminate it by projecting out of \(e\)
with an index \(i_k\) (included in the type), giving an expression of
the type \(t_k\) corresponding to that index. If we're given a bunch of
stuff packaged together we can take out just the one part we want.

In our current system, typechecking the projection of a value out of a record
[[https://github.com/informalsystems/quint/blob/545b14fb8c19ac71d8f08fb8500ce9cc3cabf678/quint/src/types/specialConstraints.ts#L91-L120][implements]] the following rule

$$
\frac
{ \Gamma \vdash e \colon (r, c) \quad \Gamma \vdash `l' \colon str \quad fresh(t) }
{ \Gamma \vdash \ field(e, `l') \ \colon (t, c \land r \sim \{ \ l \colon t | tail\_t \ \}) }
$$

where

- we use the judgement syntax established in
  [[https://github.com/informalsystems/quint/tree/main/doc/adr005-type-system.md][ADR5]],
  in which \(\Gamma \vdash e : (t, c)\) means that, in the typing
  context \(\Gamma\), expression \(e\) can be derived with type \(t\)
  under constraints \(c\),
- \(fresh(t)\) is a side condition requiring the type variable \(t\) to
  be fresh in \(\Gamma\),
- \(`l'\) is a string literal with the internal representation \(l\),
- \(c\) are the constraints derived for the type \(r\),
- \(tail\_t\) is a free row-variable constructed by prefixing the fresh
  variable \(t\) with "tail",
- \(\{ \ l \colon t | tail\_t \ \}\) is the open row-based record type
  with field, \(l\) assigned type \(t\) and free row- left as a free
  variable,
- and \(r \sim \{ \ l \colon t | tail\_t \ \}\) is a unification
  constraint.

Comparing the textbook rule with the rule in our system helps make the
particular qualities and idiosyncrasies of our system very clear.

The most critical difference w/r/t to the complexity of the typing rules
derives form the fact that our system subordinates construction and
elimination of records to the language level operator application rather
than implementing it via a special constructs that work with product
indexes (labels) directly. This is what necessitates the consideration
of the string literal \(`l'\) in our premise. In our rule for type
checking record projections we "lift" quint expressions (string literals
for records and ints for products) into product indexes.

The most salient difference is the use of unification constraints. This
saves us having to "inspect" the record type to ensure the label is
present and obtain its type. These are both accomplished instead via the
unification of \(r\) with the minimal open record including the fresh
type \(t\), which will end up holding the inferred type for the
projected value iff the unification goes through. This feature of our
type system is of special note for our aim of introducing sum-types:
almost all the logic for ensuring the correctness of our typing
judgements is delegated to the unification rules for the row-types that
carry our fields for product type and sum types alike.

**** Injection
Here is a concrete example of injecting a value into a sum type:

#+begin_src quint
val n : int = 1
val ex : A(int) = A(1)
#+end_src

A textbook rule for eliminating an expression belonging to a finite
product type can be given as

$$
\frac
{ \Gamma \vdash e \colon \tau_k  \quad (1 \le k \le n)}
{ \Gamma \vdash i_k \cdot e \colon \langle i_1 \hookrightarrow \tau_1, \ \ldots, \ i_n \hookrightarrow \tau_n \rangle }
$$

Where \(i\) is drawn from a finite set of indexes used to label the
possible alternatives of the co-product and
\(i_j \hookrightarrow \tau_j\) maps the index \(i_j\) to the
corresponding type \(\tau_j\). We use \(\langle \ldots \rangle\) to
indicate the labeling is now disjunctive and \(i_k \cdot e\) as the
injection of \(e\) into the sum type using label \(i_k\). Note the
symmetry with complementary rule for projection out of a record: the
only difference is that the (now disjunctive) row (resp. (now injected)
expression) is swapped from premise to conclusion (resp. from conclusion
to premise).

This rule tells us that, when an expression \(e\) with a type \(t_k\) is
derivable from a context, we can include it as an alternative in our sum
type by injecting it with the label \(i_k\), giving an element of our
sum type. If we're given a thing that has a type allowed by our
alternatives, it can included among our alternatives.

If we were following the row-based approach outlined in
[[https://www.microsoft.com/en-us/research/publication/extensible-records-with-scoped-labels/][Leijen05]],
then the proposed rule in our system, formed by seeking the same
symmetry w/r/t projection out from a product, would be:

$$
\frac
{ \Gamma \vdash e \colon (t, c) \quad \Gamma \vdash `l' \colon str \quad fresh(s) }
{ \Gamma \vdash \ variant(`l', e) \ \colon (s, c \land s \sim \{ \ l \colon t | tail\_s \ \}) }
$$

Comparing this with our current rule for projecting out of records, we
see the same symmetry: the (now disjunctive) row type is synthesized
instead of being taken from the context.

However, if we don't want to expose the row-polymorphism to users, we need a
more constrained rule that will ensure the free row variable is not surfaced. We
can address this by replacing the side condition requiring $s$ to be free with a side
condition requiring that there it be defined, and in our constraint check that
we can unify that defined type with a row that contains the given label with the
expected type and is otherwise open.

$$
\frac
{
\Gamma \vdash e \colon (t, c) \quad
\Gamma \vdash `l' \colon str \quad
definedType(s) \quad
free(v)
}
{
\Gamma \vdash \ variant(`l', e) \ :
(s, c \land s \sim \langle \ l \colon t | v \ \rangle)
}
$$


Igor has voiced a strong preference that we do not allow anonymous or
row-polymorphic sum types, which is why the last rule is proposed. It does
complicate our typing rules, as it requires we draw from the typing context.


*** Introducing products and eliminating sums
Forming expressions of product types by backing them into records and
eliminating expressions of sum types by case analysis exhibit the same
duality, tho they are a bit more complex.

