docs/pages/docs/development-docs/rfcs/rfc001-sum-types/rfc001-sum-types.org
**** Packing expressions into records
Here is a concrete example of forming a record using our current syntax:

#+begin_src quint
val n : int = 1
val s : str = "one"
val ex : {a : int, b : str} = {a : n, b : s}
// Or, using our exotic Rec operator, which is currently the normal form
val ex_ : {a : int, b : str} = Rec("a", n, "b", s)
#+end_src

A textbook introduction rule for finite products is given as

$$
\frac
{ \Gamma \vdash e_1 \colon \tau_1 \quad \ldots \quad \Gamma \vdash e_n \colon \tau_n }
{ \Gamma \vdash \{ i_1 \hookrightarrow e_1, \ldots, i_n \hookrightarrow e_n \} \colon \{ i_1 \hookrightarrow \tau_1, \ldots, i_n \hookrightarrow \tau_n \} }
$$

This tells us that for any expressions
\(e_1 : \tau_1, \ldots, e_n : \tau_n\) derivable from our context we can
form a product that indexes those \(n\) expressions by
\(i_1, \ldots, i_n\) distinct labels, and packages all data together in
an expression of type
\(\{ i_1 \hookrightarrow \tau_1, \ldots, i_n \hookrightarrow \tau_n \}\).
If we're given all the things of the needed types, we can conjoint them
all together into one compound package.

The following rule describes our current implementation:

$$
\frac
{ \Gamma \vdash (`i_1`, e_1 \colon (t_1, c_1)) \quad \ldots \quad \Gamma \vdash (`i_1`, e_n \colon (t_n, c_n)) \quad fresh(s) }
{ \Gamma \vdash Rec(`i_1`, e_1, \ldots, `i_n`, e_n) \ \colon \ (s, c_1 \land \ldots \land c_n \land s \sim \{ i_1 \colon t_1, \ldots, i_n \colon t_n \}) }
$$

The requirement that our labels show up in the premise as quint strings
paired with each element of the appropriate type is, again, an artifact
of the exotic operator discussed later, as is the =Rec= operator in the
conclusion that consumes these strings. Ignoring those details, this
rule is quite similar to the textbook rule, except we use unification of
the fresh variable =s= to propagate the type of the constructed record,
and we have to do some bookkeeping with the constraints from each of the
elements that will be packaged into the record.

**** Performing case analysis
Here is a concrete example of case analysis to eliminate an expression
belonging to a sum type using the proposed syntax variants:

#+begin_src quint
val e : T = A(1)
def describeInt(n: int): str = if (n < 0) then "negative" else "positive"
val ex : str = match e {
  | A(x) => describeInt(x)
  | B(x) => x
}
#+end_src

A textbook rule for eliminating an expression that is a variant of a
finite sum type can be given as

$$
\frac{
\Gamma \vdash e \colon 
\langle i_1 \hookrightarrow \tau_1, \ldots, i_n \hookrightarrow \tau_n \rangle 
\quad 
\Gamma, x_1 : \tau_1 \vdash e_1 \colon \tau
\quad 
\ldots
\quad 
\Gamma, x_n : \tau_n \vdash e_n \colon \tau
}
{ \Gamma \vdash \ match \ e \ 
\{ i_1 \cdot x_1 \hookrightarrow e_1 | \ldots | i_n \cdot x_n \hookrightarrow e_n \} : \tau }
$$

Note the complementary symmetry compared with the textbook rule for
product construction: product construction requires =n= expressions to
conclude with a single record-type expression combining them all; while
sum type elimination requires a single sum-typed expression and =n= ways
to convert each of the =n= alternatives of the sum type to conclude with
a single expression of a type that does not need to appear in the sum
type at all.

The proposed rule for quint's type system is given without an attempt to
reproduce our practice of using quint strings. This can be added in
later if needed:

$$
\frac{
\Gamma \vdash e : (s, c) \quad
\Gamma, x_1 \vdash e_1 : (t, c_1) \quad \ldots \quad \Gamma, x_n \vdash e_n : (t, c_n) \quad
\Gamma, \langle v \rangle \vdash e_{n+1} : (t, c_{n+1}) \quad
fresh(v)
}{
\Gamma \vdash \ match \ e \ \{ i_1 : x_1 \Rightarrow e_1, \ldots, i_n : x_n \Rightarrow e_n \} : (t,
c \land c_1 \land \ldots \land c_n \land c_{n+1} \land
s \sim \langle i_1 : t_1, \ldots, i_n : t_n | v \rangle)
}
$$

Compared with quint's rule for product construction we see the same
complementary symmetry. However, we also see a striking difference:
there is no row variable occurring in the product construction, but the
row variable plays an essential function in sum type elimination of
row-based variants. Row types in records are useful for extension
operations (i.e., which we don't support in quint currently) and for
operators that work over some known fields but leave the rest of the
record contents variable. But the core idea formalized in a product type
is that the constructor /must/ package all the specified things together
so that the recipient /can/ chose any thing; thus, when a record is
constructed we must supply all the things and there is no room for
variability in the row. For sum types, in contrast the constructor /can/
supply any one thing (of a valid alternate type), and requires the
recipient /must/ be prepared to handle every possible alternative.

In the presence of row-polymorphis, however, the responsibility of the
recipient is relaxed: the recipient can just handle a subset of the
possible alternatives, and if the expression falls under a label they
are not prepared to handle, they can pass the remaining responsibility
on to another handler.

Here is a concrete example using the proposed syntax, note how we narrow
the type of =T=:

#+begin_src quint
type T = A | B;;
def f(e) = match e {
  | A => 1
  | B => 2
  | _ => 0
}

// f can be applied to a value of type T
let a : T = A
let ex : int = f(A)

// but since it has a fallback for an open row, it can also handle any other variant
let foo = Foo
let ex_ : int = f(foo)
#+end_src

Here's the equivalent evaluated in OCaml as proof of concept:

#+begin_src ocaml
utop # 
type t = [`A | `B]
let f = function
  | `A -> 1
  | `B -> 2
  | _  -> 0
let ex = f `A, f `Foo
;;
type t = [ `A | `B ]
val f : [> `A | `B ] -> int = <fun>
val ex : int * int = (1, 0)
#+end_src

All the features just discussed that come from row-polymorphism will not be
available since we are choosing to suppress the row-typing.

** Concrete Syntax

*** Why not support "polymorphic variants"
Our sum type system is based on row-polymorphism. The only widely used language
I've found that uses row-polymorphism for extensible sum types is OCaml (and the
alternative surface syntax, ReScript/Reason). For examples of their syntax for
this interesting construct, see

- ReScript :: https://rescript-lang.org/docs/manual/latest/polymorphic-variant
- OCaml :: https://v2.ocaml.org/manual/polyvariant.html

These very flexible types are powerful, but they introduce challenges to the
syntax (and semantics) of programs. For example, supporting anonymous variant
types requires a way of constructing variants without pre-defined constructors.
Potential approaches to address this include:

  - A special syntax that (ideally) mirrors the syntax of the type.
  - A special lexical marker on the labels (what ReScrips and OCaml do),
    e.g., =`A 1= or =#a 1= instead of =A(1)=.

However, we have instead opted to hide the row-polymorphism, and not expose
this.

*** Declaration

**** Why use the =|= syntax to separate alternatives?

- In programming =|= is [[https://en.wikipedia.org/wiki/Vertical_bar#Disjunction][widely used for disjunction]]:
  - regex
  - boolean "or"
  - bitwise "or"
  - alternatives in BNF
  - parallel execution on the pi-calculus
- Many modern languages with support for sum types (or the more general union
  types) use =|=, including
  - [[https://docs.python.org/3/library/typing.html#typing.Union][Python]]
  - [[https://www.typescriptlang.org/docs/handbook/2/everyday-types.html#union-types][TypeScript]]
  - (of course) the MLs, Haskell, F#, Elm, OCaml, etc.

