docs/pages/docs/development-docs/rfcs/rfc001-sum-types/rfc001-sum-types.org
**** Why not use =,= to separate alternatives?

We have discussed modeling our concrete syntax for sum type declarations on
Rust. But without changes to other parts of our language, this would leave the
concrete syntax for type declarations too similar to record type declarations.

This similarity is aggravated by the fact that we currently don't enforce any
case-based syntactic rules to differentiate identifiers used for  operator
names, variables, or module names, and we are currently planning to extend this
same flexibility to variant labels, just as we do for record field labels.
Thus, we could end up with a pair of declarations like:

#+begin_src quint
type T = {
    A : int,
    b : str,
}

type S = {
    A(int),
    b(str),
}
#+end_src

We are not confident that the difference between =_:_= and =_(_)= will be enough
to keep readers from confusing the two.

But the chance of mistaking a record and sum type declaration is actually
compounding a worse possible confusion: the part of a sum-type record enclosed
in brackets is syntactically indistinguishable from a block of operators
applications.

Given we tend to read data structures from the outside in, we feel confident
that we were going to avoid confusion by requiring declarations to use =|= to
demarcate alternatives:

#+begin_src quint
type T = {
    a : int,
    B : str,
}

type S =
    | A(int)
    | b(str)
#+end_src

The latter seems much clearer to our team, and if we reflect this syntax also in
=match=, it will give another foothold to help readers gather meaning when
skimming the code.


**** Could we just copy Rust exactly?

In Rust, sum types are declared like this:

#+begin_src rust
enum T {
  A(i64),
  B(i64),
  C
}
#+end_src

If we just adopted this syntax directly without also changing our syntax for
records, we would introduce

- Breaks with our current convention around type declarations and
  use of keywords.
- May mislead users to try injecting values into the type via Rust's
  =T::A(x)= syntax, which clashes with our current module syntax.
- This would move us closer to Rust but further from languages like [[https://www.typescriptlang.org/docs/handbook/2/everyday-types.html#type-aliases][TypeScript]]
  and Python.

Rust't syntax makes pretty good sense _within the context of the rest of Rust's
syntax_. Here is an overview:

*declaration*

#+begin_src rust
struct Pair {
    fst: u64,
    snd: String
}

enum Either {
    Left(u64),
    Right(String)
}
#+end_src

*construction*

#+begin_src rust
let s = Either::Left(4)
let p = Pair{
    fst: 4,
    snd: "Two"
}
#+end_src

*elimination*

#+begin_src rust
let two = p.snd
let four = s match {
    Either::Left(_) => 4,
    Either::Right(_) => 4
}
#+end_src

Note how the various syntactic elements work together to give consistent yet
clearly differentiated forms of expression for dual constructs:

- The prefix keyword for declarations consistently (=enum= vs. =struct=).
- A unique constructor name is used consistently for forming a record or
  variant.
- Lexical rules add clear syntactic markers:
  - Data constructors must begin with a capital letter
  - Field names of a struct (and method names of a trait, and module names) must
  begin with a lowercase letter.
  - This ensures the syntax for module access and sum type construction are
    unambiguous: =mymod::foo(x)= vs =MySumType::Foo(x)=.
  - The caps/lower difference also helps reflect the duality between record
    fields and sum type alternatives.

Compare with the syntax proposed for quint this RFC:

*declaration*

#+begin_src quint
type Pair = {
  fst: int,
  snd: str,
}

type Either =
  | left(int),
  | right(str)
#+end_src

*construction*

#+begin_src quint
let s = left(4)
let p = {
    fst: 4,
    snd: "Two"
}
#+end_src

*elimination*

#+begin_src rust
let two = p.snd
let four = s match {
    | left(_) => 4
    | right(_) => 4
}
#+end_src

Following the current quint syntax, we don't differentiate declaration with
keywords or data construction with prefix use of type names. But we make up for
this lost signal with the evident difference between =|= and =,=. This also
compensates for the inability to differentiate based on capitalization.

Finally, by adopting a syntax that if very similar to C++-like languages (like
Rust), we risk presenting false friends. There are numerous subtle differences
between quint and Rust, and if we lull users into thinking the syntax is
roughly the same, they are likely to be disappointed when they discover that, e.g.,

- Unlike Rust, conditions in =if= must be wrapped in =(...)=
- Unlike Rust, conditions must have an =else= branch
- Unlike Rust, =let= is not used for binding
- Unlike Rust, type parameters are surrounded in =[...]= rather than =<...>=
- Unlike Rust, operator are declared with =def=
- Unlike Rust, type variables must begin with a lower-case letter

In short, given how many ways we differ from Rust syntax already, adopting
Rust's syntax for sum types would be confusing in the context of our current
suntax and possibly lead to incorrect expectations.

**** What if we want to be more Rust-like

If we want to use a syntax for sum types that is closer to, or exactly the same
as, Rust's, then we should make at least the following changes to the rest of
our syntax to preserve harmony:

- Require a prefix name relating to a type when constructing data, e.g., =Foo
  {a: 1, b: 2}= for constructing a record of type =Foo=. (Note this would mean
  dropping support for anonymous records types.)
- Introduce a lexical distinction between capitalized identifiers, used for
  data constructors (and type constants), and uncapitalized identifiers, used
  for records field labels and operators.
- Use keywords consistently for type declarations.

Taking these changes into account, we could render the previous quint examples
thus:

*declaration*

#+begin_src quint
type Pair = struct {
  fst: u64,
  snd: String
}

type Either = enum {
  Left(u64),
  Right(String)
}
#+end_src

*construction*

#+begin_src quint
let s = Left(4)
let p = Pair {
    fst: 4,
    snd: "Two"
}
#+end_src

*elimination*

#+begin_src rust
let two = p.snd
let four = s match {
    Left(_) => 4,
    Right(_) => 4,
}
#+end_src


