docs/pages/docs/development-docs/rfcs/rfc001-sum-types/rfc001-sum-types.org
*** Case analysis
Ergonomic support for sum types requires eliminators, ideally in the
form if case analysis by pattern matching.

The proposed syntax is close to [[https://doc.rust-lang.org/book/ch18-03-pattern-syntax.html#matching-literals][Rust's pattern syntax]], modulo swapping =|=
for =,= to be consistent with the type declaration syntax.

Here's some example Rust for comparison

#+begin_src rust
    match x {
        A    => println!("a"),
        B    => println!("b"),
        C(v) => println!("cv"),
        _    => println!("anything"),
    }
#+end_src

The =match= is a close analogue to our existing =if= expressions, and
the reuse of the ==>= hints at the connection between case elimination
and anonymous operators. The comma separated alternatives enclosed in
={...}= follow the variadic boolean action operators, which seems
fitting, since sum types are disjunction over data.

One question if we adopt some form of pattern-based case analysis is how far we
generalize the construct. Do we support pattern matching on scalars like ints
and symbols? Do we support pattern matching to deconstruct compound data such as
records and lists? What about sets? Do we allow pattern expressions to serve as
anonymous operator (like Scala)?

My guess is that in most cases the gains in expressivity of specs would justify
the investment, but it is probably best to start with limiting support to
defined sum types and seeing where we are after that.

Until we have pattern matching introduced, we should flag a parsing error if the
deconstructor argument is not a free variable, and inform the user that full pattern
matching isn't yet supported.

*** Sketch of an alternative syntax
The syntax being proposed is chosen because it is familiar to Rust programmers,
and is deemed sufficient so long as we don't need to expose the underlying row
polymorphism. However, it has the down-sides of being very similar to the syntax
for records, which might lead to confusion. I've also considered a more distinctive alternative which
is also more consistently complementary to our records syntax. This group of alternatives follows [[https://www.microsoft.com/en-us/research/publication/extensible-records-with-scoped-labels/][Leijen05]]:

**** Declaration

Reflecting the fact that both records and sum types are based on rows, we
use the same pairing (=:=) and enumerating (=,=) syntax, but signal to move from
a conjunctive to a disjunctive meaning of the row by changing the brackets:

#+begin_src quint
type T =
  < A : int
  , B : str
  >
#+end_src

**** Injection

Injection uses a syntax that is dual with projection on records: =.= projects
values out of products and injects them into co-products:

#+begin_src quint
val a : T = <A.1>
#+end_src

Since this option gives a syntactically unambiguous representation of
variant formation, there is no need to generate special injector operator, and
=<_._>= can be the normal form for injection.

Annotation of anonymous sum types is clear and unambiguous:

#+begin_src quint
def f(n: int): <C:int, D:str | s> =
  if (n >= 0) <C.n> else <D."negative">
#+end_src

Compare with the corresponding annotation for a record type:

#+begin_src quint
def f(n: int): {C:int, D:str | s} =
  if (n >= 0) {C:n, D:"positive"} else {C:n, B:"negative"}
#+end_src

**** Elimination

Finally, elimination uses a syntax that is dual to record construction,
signaling the similarity thru use of the surrounding curly braces, and
difference via the presence of the fat arrows (this syntax is similar to the
one proposed):

#+begin_src quint
match e {
  A : a => ...,
  B : b => ...
}
#+end_src

** High-level implementation plan

- Add parsing and extension of the IR for the syntax :: https://github.com/informalsystems/quint/pull/1092
- Add generation of constructor operators :: https://github.com/informalsystems/quint/pull/1093
- Add rules for type checking :: https://github.com/informalsystems/quint/issues/244
- Add support in the simulator :: https://github.com/informalsystems/quint/issues/1033
- Add support for converting to Apalache :: https://github.com/informalsystems/quint/issues/1034

** Additional consideration
*** Pattern matching
We may want to consider support for pattern matching at some point. I suspect
the =match= construct will make users want this, but then again perhaps quint
is simple enough that we can do without this complication. We'd also have to
consider carefully how this would work with conversion to the Apalache IR.

*** User defined parametric type constructors

If we want to gain the most value from the addition of sum types we should allow
users to define parametric types such as =Option= and =Either=. See
https://github.com/informalsystems/quint/issues/1073 .

*** Drop the exotic operators
- Remove the special product type operators =fieldNames=, =Rec=, =with=,
  =label=, and =index=, or add support for first-class labels As is, I
  think these are not worth the complexity and overhead.

Compare our rule with the projection operation from "Extensible Records
with Scoped Labels", which does not receive the label `l' as a string,
instead treating it as a special piece of syntax:

#+begin_src haskell
(_.l) :: ∀r α. (l|r) ⇒ {l :: α | r } → α`
#+end_src

Another point of comparison is Haskell's
[[https://www.haskell.org/onlinereport/haskell2010/haskellch3.html#x8-490003.15]["Datatypes
with Field Labels"]], which generates a projection function for each
label, so that defining the datatype

#+begin_src haskell
data S = S1 { a :: Int, b :: String }
#+end_src

will produce functions

#+begin_src haskell
a :: S -> Int
b :: S -> String
#+end_src

**** Benefits

***** Simplified typing rules
Abandoning this subordination to normal operator application would leave
us with a rule like the following for record projection:

$$
\frac
{ \Gamma \vdash e \colon (r, c) \quad fresh(t) }
{ \Gamma \vdash \ e.l \ \colon (t, c \land r \sim \{ \ l \colon t | tail\_t \ \}) }
$$

This would allow us to remove the checks for string literals, instead leaving that
to the outermost, syntactic level of our static analysis. A similar
simplification would follow for record construction: the rule for =Rec= would
not need to validate that it had received an even number of argument of
alternating string literals and values, since this would be statically
guaranteed by the parsing rules for the \(\{ l_1 : v_1, \ldots, l_n : v_n \}\)
syntax. This would be a case of opting for the [[https://lexi-lambda.github.io/blog/2019/11/05/parse-don-t-validate/]["Parse, don't validate"]] strategy.

***** Safer language

The added surface area introduced by these operators have contributed to several
bugs, including at least the ones discussed here:

- https://github.com/informalsystems/quint/issues/169
- https://github.com/informalsystems/quint/issues/816
- https://github.com/informalsystems/quint/issues/1081

