docs/pages/docs/development-docs/rfcs/rfc001-sum-types/rfc001-sum-types.tex


\subsubsection{Case analysis}
\label{sec:org1404ef7}
Ergonomic support for sum types requires eliminators, ideally in the
form if case analysis by pattern matching.

The proposed syntax is close to \href{https://doc.rust-lang.org/book/ch18-03-pattern-syntax.html\#matching-literals}{Rust's pattern syntax}, modulo swapping \texttt{|}
for \texttt{,} to be consistent with the type declaration syntax.

Here's some example Rust for comparison

\begin{verbatim}
    match x {
        A    => println!("a"),
        B    => println!("b"),
        C(v) => println!("cv"),
        _    => println!("anything"),
    }
\end{verbatim}

The \texttt{match} is a close analogue to our existing \texttt{if} expressions, and
the reuse of the \texttt{=>} hints at the connection between case elimination
and anonymous operators. The comma separated alternatives enclosed in
\texttt{\{...\}} follow the variadic boolean action operators, which seems
fitting, since sum types are disjunction over data.

One question if we adopt some form of pattern-based case analysis is how far we
generalize the construct. Do we support pattern matching on scalars like ints
and symbols? Do we support pattern matching to deconstruct compound data such as
records and lists? What about sets? Do we allow pattern expressions to serve as
anonymous operator (like Scala)?

My guess is that in most cases the gains in expressivity of specs would justify
the investment, but it is probably best to start with limiting support to
defined sum types and seeing where we are after that.

Until we have pattern matching introduced, we should flag a parsing error if the
deconstructor argument is not a free variable, and inform the user that full pattern
matching isn't yet supported.

\subsubsection{Sketch of an alternative syntax}
\label{sec:org726607c}
The syntax being proposed is chosen because it is familiar to Rust programmers,
and is deemed sufficient so long as we don't need to expose the underlying row
polymorphism. However, it has the down-sides of being very similar to the syntax
for records, which might lead to confusion. I've also considered a more distinctive alternative which
is also more consistently complementary to our records syntax. This group of alternatives follows \href{https://www.microsoft.com/en-us/research/publication/extensible-records-with-scoped-labels/}{Leijen05}:

\begin{enumerate}
\item Declaration
\label{sec:org78427f0}

Reflecting the fact that both records and sum types are based on rows, we
use the same pairing (\texttt{:}) and enumerating (\texttt{,}) syntax, but signal to move from
a conjunctive to a disjunctive meaning of the row by changing the brackets:

\begin{verbatim}
type T =
  < A : int
  , B : str
  >
\end{verbatim}

\item Injection
\label{sec:orgd20c363}

Injection uses a syntax that is dual with projection on records: \texttt{.} projects
values out of products and injects them into co-products:

\begin{verbatim}
val a : T = <A.1>
\end{verbatim}

Since this option gives a syntactically unambiguous representation of
variant formation, there is no need to generate special injector operator, and
\texttt{<\_.\_>} can be the normal form for injection.

Annotation of anonymous sum types is clear and unambiguous:

\begin{verbatim}
def f(n: int): <C:int, D:str | s> =
  if (n >= 0) <C.n> else <D."negative">
\end{verbatim}

Compare with the corresponding annotation for a record type:

\begin{verbatim}
def f(n: int): {C:int, D:str | s} =
  if (n >= 0) {C:n, D:"positive"} else {C:n, B:"negative"}
\end{verbatim}

\item Elimination
\label{sec:org84c35ee}

Finally, elimination uses a syntax that is dual to record construction,
signaling the similarity thru use of the surrounding curly braces, and
difference via the presence of the fat arrows (this syntax is similar to the
one proposed):

\begin{verbatim}
match e {
  A : a => ...,
  B : b => ...
}
\end{verbatim}
\end{enumerate}

\subsection{High-level implementation plan}
\label{sec:orgd09f6a5}

\begin{description}
\item[{Add parsing and extension of the IR for the syntax}] \url{https://github.com/informalsystems/quint/pull/1092}
\item[{Add generation of constructor operators}] \url{https://github.com/informalsystems/quint/pull/1093}
\item[{Add rules for type checking}] \url{https://github.com/informalsystems/quint/issues/244}
\item[{Add support in the simulator}] \url{https://github.com/informalsystems/quint/issues/1033}
\item[{Add support for converting to Apalache}] \url{https://github.com/informalsystems/quint/issues/1034}
\end{description}

\subsection{Additional consideration}
\label{sec:org0d2407a}
\subsubsection{Pattern matching}
\label{sec:orgbddbca7}
We may want to consider support for pattern matching at some point. I suspect
the \texttt{match} construct will make users want this, but then again perhaps quint
is simple enough that we can do without this complication. We'd also have to
consider carefully how this would work with conversion to the Apalache IR.

\subsubsection{User defined parametric type constructors}
\label{sec:org1a4beae}

If we want to gain the most value from the addition of sum types we should allow
users to define parametric types such as \texttt{Option} and \texttt{Either}. See
\url{https://github.com/informalsystems/quint/issues/1073} .

\subsubsection{Drop the exotic operators}
\label{sec:orgd5aba72}
\begin{itemize}
\item Remove the special product type operators \texttt{fieldNames}, \texttt{Rec}, \texttt{with},
\texttt{label}, and \texttt{index}, or add support for first-class labels As is, I
think these are not worth the complexity and overhead.
\end{itemize}

Compare our rule with the projection operation from ``Extensible Records
with Scoped Labels'', which does not receive the label `l' as a string,
instead treating it as a special piece of syntax:

\begin{verbatim}
(_.l) :: ∀r α. (l|r) ⇒ {l :: α | r } → α`
\end{verbatim}

Another point of comparison is Haskell's
\href{https://www.haskell.org/onlinereport/haskell2010/haskellch3.html\#x8-490003.15}{``Datatypes
with Field Labels''}, which generates a projection function for each
label, so that defining the datatype

\begin{verbatim}
data S = S1 { a :: Int, b :: String }
\end{verbatim}

will produce functions

\begin{verbatim}
a :: S -> Int
b :: S -> String
\end{verbatim}

\begin{enumerate}
\item Benefits
\label{sec:org36441ad}

\begin{enumerate}
\item Simplified typing rules
\label{sec:org0e97219}
Abandoning this subordination to normal operator application would leave
us with a rule like the following for record projection:

$$
\frac
{ \Gamma \vdash e \colon (r, c) \quad fresh(t) }
{ \Gamma \vdash \ e.l \ \colon (t, c \land r \sim \{ \ l \colon t | tail\_t \ \}) }
$$

This would allow us to remove the checks for string literals, instead leaving that
to the outermost, syntactic level of our static analysis. A similar
simplification would follow for record construction: the rule for \texttt{Rec} would
not need to validate that it had received an even number of argument of
alternating string literals and values, since this would be statically
guaranteed by the parsing rules for the \(\{ l_1 : v_1, \ldots, l_n : v_n \}\)
syntax. This would be a case of opting for the \href{https://lexi-lambda.github.io/blog/2019/11/05/parse-don-t-validate/}{``Parse, don't validate''} strategy.

\item Safer language
\label{sec:org53a2258}

The added surface area introduced by these operators have contributed to several
bugs, including at least the ones discussed here:

\begin{itemize}
\item \url{https://github.com/informalsystems/quint/issues/169}
\item \url{https://github.com/informalsystems/quint/issues/816}
\item \url{https://github.com/informalsystems/quint/issues/1081}
\end{itemize}
