docs/pages/docs/development-docs/rfcs/rfc001-sum-types/rfc001-sum-types.org
***** More maintainable code base

We are losing structure in our internal representation of expressions, which
means we get less value out of typescript type system, have to do more work
when converting to the Apalache IR, and have to deal with more fussy details. By
converting the rich structures of records into an internal representation
=Rec(expr1, ..., expr1)=

- we lose the ability to ensure we are forming records correctly statically
- have to do manual arithmetic to ensure fields and values are paired up
  correctly
- essentially reduce ourselves to a "stringly typed" representation, relying
  entirely on detecting the =Rec= value in the =kind= field.


[fn:1] The expressive power of these simple constructs comes from the
       nice algebraic properties revealed when values of a type are
       treated as equal up-to ismorphism. See, e.g.,
       [[https://codewords.recurse.com/issues/three/algebra-and-calculus-of-algebraic-data-types]]
