docs/pages/docs/development-docs/rfcs/rfc001-sum-types/rfc001-sum-types.tex

\item More maintainable code base
\label{sec:org03c9b45}

We are losing structure in our internal representation of expressions, which
means we get less value out of typescript type system, have to do more work
when converting to the Apalache IR, and have to deal with more fussy details. By
converting the rich structures of records into an internal representation
\texttt{Rec(expr1, ..., expr1)}

\begin{itemize}
\item we lose the ability to ensure we are forming records correctly statically
\item have to do manual arithmetic to ensure fields and values are paired up
correctly
\item essentially reduce ourselves to a ``stringly typed'' representation, relying
entirely on detecting the \texttt{Rec} value in the \texttt{kind} field.
\end{itemize}
\end{enumerate}
\end{enumerate}
\end{document}